Revit 2026 API

# ExternalResourceBrowserDataAddResource(String, IDictionaryString, String) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddResource(
	string resourceName,
	IDictionary<string, string> referenceInformation
)
```
```vb
Public Sub AddResource (
	resourceName As String,
	referenceInformation As IDictionary(Of String, String)
)
```
```cpp
public:
void AddResource(
	String^ resourceName,
	IDictionary<String^, String^>^ referenceInformation
)
```
```fsharp
member AddResource :
        resourceName : string *
        referenceInformation : IDictionary<string, string> -> unit
```

#### Parameters

resourceName String

referenceInformation IDictionaryString, String

#### Reference

ExternalResourceBrowserData Class

AddResource Overload

Autodesk.Revit.DB Namespace